load-test-results-20251120-164220/API_Gateway_Health.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking api-gateway-3daykcsw5a-ew.a.run.app (be patient).....done


Server Software:        Google
Server Hostname:        api-gateway-3daykcsw5a-ew.a.run.app
Server Port:            443
SSL/TLS Protocol:       TLSv1.2,ECDHE-ECDSA-CHACHA20-POLY1305,256,256
Server Temp Key:        ECDH X25519 253 bits
TLS Server Name:        api-gateway-3daykcsw5a-ew.a.run.app

Document Path:          /actuator/health
Document Length:        15 bytes

Concurrency Level:      5
Time taken for tests:   13.988 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      49004 bytes
HTML transferred:       1500 bytes
Requests per second:    7.15 [#/sec] (mean)
Time per request:       699.407 [ms] (mean)
Time per request:       139.881 [ms] (mean, across all concurrent requests)
Transfer rate:          3.42 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      238  483 164.7    458    1442
Processing:   136  179  29.2    175     305
Waiting:      136  175  26.2    173     299
Total:        388  662 171.3    645    1613

Percentage of the requests served within a certain time (ms)
  50%    645
  66%    659
  75%    673
  80%    682
  90%    734
  95%    777
  98%   1549
  99%   1613
 100%   1613 (longest request)