load-test-results-20251120-164220/User_Service_Direct.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking user-service-3daykcsw5a-ew.a.run.app (be patient).....done


Server Software:        Google
Server Hostname:        user-service-3daykcsw5a-ew.a.run.app
Server Port:            443
SSL/TLS Protocol:       TLSv1.2,ECDHE-ECDSA-CHACHA20-POLY1305,256,256
Server Temp Key:        ECDH X25519 253 bits
TLS Server Name:        user-service-3daykcsw5a-ew.a.run.app

Document Path:          /actuator/health
Document Length:        429 bytes

Concurrency Level:      5
Time taken for tests:   14.139 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      87200 bytes
HTML transferred:       42900 bytes
Requests per second:    7.07 [#/sec] (mean)
Time per request:       706.928 [ms] (mean)
Time per request:       141.386 [ms] (mean, across all concurrent requests)
Transfer rate:          6.02 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      207  483 131.0    468    1501
Processing:   138  180  24.2    176     292
Waiting:      131  175  22.4    172     292
Total:        368  663 136.1    653    1684

Percentage of the requests served within a certain time (ms)
  50%    653
  66%    667
  75%    690
  80%    702
  90%    752
  95%    790
  98%   1086
  99%   1684
 100%   1684 (longest request)